gicking/STM8_headers/SVD/STM8AL3LE8A.svd
      </registers>
      <interrupt>
        <name>I2C1_ADD10</name>
        <description>I2C1_ADD10 interrupt</description>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>I2C1_ADDR</name>
        <description>I2C1_ADDR interrupt</description>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>I2C1_AF</name>
        <description>I2C1_AF interrupt</description>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>I2C1_ARLO</name>
        <description>I2C1_ARLO interrupt</description>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>I2C1_BERR</name>
        <description>I2C1_BERR interrupt</description>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>I2C1_BTF</name>
        <description>I2C1_BTF interrupt</description>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>I2C1_OVR</name>
        <description>I2C1_OVR interrupt</description>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>I2C1_RXNE</name>
        <description>I2C1_RXNE interrupt</description>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>I2C1_SB</name>
        <description>I2C1_SB interrupt</description>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>I2C1_STOPF</name>
        <description>I2C1_STOPF interrupt</description>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>I2C1_TXE</name>
        <description>I2C1_TXE interrupt</description>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>I2C1_WUFH</name>
        <description>I2C1_WUFH interrupt</description>
        <value>29</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>IRTIM</name>
      <baseAddress>0x52FF</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x0001</size>
        <usage>registers</usage>
      </addressBlock>
      <description>IRTIM</description>
      <groupName>IRTIM</groupName>
      <registers>
        <register>
          <name>CR</name>
          <description>Infrared control register</description>
          <addressOffset>0x0000</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>IR_EN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HS_EN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>ITC_EXTI</name>
      <baseAddress>0x50A0</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x000C</size>
        <usage>registers</usage>
      </addressBlock>
      <description>ITC_EXTI</description>
      <groupName>ITC_EXTI</groupName>
      <registers>
        <register>
          <name>CR1</name>
          <description>External interrupt control register 1</description>
          <addressOffset>0x0000</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>P0IS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>P1IS</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>P2IS</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>P3IS</name>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>External interrupt control register 2</description>
          <addressOffset>0x0001</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>P4IS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>P5IS</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>P6IS</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>P7IS</name>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR3</name>
          <description>External interrupt control register 3</description>
          <addressOffset>0x0002</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PBIS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PDIS</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PEIS</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PFIS</name>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR1</name>
          <description>External interrupt status register 1</description>
          <addressOffset>0x0003</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>P0F</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P1F</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P2F</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P3F</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P4F</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P5F</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P6F</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P7F</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR2</name>
          <description>External interrupt status register 2</description>
          <addressOffset>0x0004</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PBF</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PDF</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEF</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PFF</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGF</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PHF</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF1</name>
          <description>External interrupt port select register 1</description>
          <addressOffset>0x0005</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PBLIS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PBHIS</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PDLIS</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PDHIS</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PELIS</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEHIS</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PFLIS</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PFES</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR4</name>
          <description>External interrupt control register 4</description>
          <addressOffset>0x000A</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PGIS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PHIS</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF2</name>
          <description>External interrupt port select register 2</description>
          <addressOffset>0x000B</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PFHIS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGLIS</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGHIS</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PHLIS</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PHHIS</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGBS</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PHDS</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
